# Pandas Series

A Series is one-demensional labeled array capable of holding any data type.The axis labels are collectively called the index.

## Creating Series

There are multiple ways to create a pandas Series:

In [49]:
import numpy as np
import pandas as pd

In [3]:
lables = ['a','b','c']
my_list = [10,20,30]

arr = np.array([10,20,30])

dict1 = {'a':10,'b':20,'c':30}

pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_list,index=lables)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(dict1)

a    10
b    20
c    30
dtype: int64

## DataFrame

### Creating a DataFrame

In [7]:
data = {
    'Name' : ['Sneha','Aditi','Shipra','Manvi','Riya'], 
    'Age' : [20,21,19,18,17], 
    'city' : ['New delhi','Dinjan','Ranchi','Mumbai','Deoria'],
    'salary' : [65000,78000,23000,10000,200000]
}

df = pd.DataFrame(data)

In [13]:
data_list = [
   ['Sneha',20,'New delhi',65000], 
   ['Aditi',21,'Dinjan',78000], 
   ['Shipra',19,'Gurjarat',54000], 
   ['Manvi',20,'Mumbai',89000]
]
col = ['Name','Age','City','Salary']
df = pd.DataFrame(data_list,columns = col)
print(df)

     Name  Age       City  Salary
0   Sneha   20  New delhi   65000
1   Aditi   21     Dinjan   78000
2  Shipra   19   Gurjarat   54000
3   Manvi   20     Mumbai   89000

### Selection and indexing of columns

In [15]:
df["Name"]

0     Sneha
1     Aditi
2    Shipra
3     Manvi
Name: Name, dtype: object

In [18]:
df[['Name','Age']]

     Name  Age
0   Sneha   20
1   Aditi   21
2  Shipra   19
3   Manvi   20

### creating new column

In [19]:
df["Designation"] = ['Doctor','Eng.','Doctor','Eng.']

In [20]:
df

     Name  Age       City  Salary Designation
0   Sneha   20  New delhi   65000      Doctor
1   Aditi   21     Dinjan   78000        Eng.
2  Shipra   19   Gurjarat   54000      Doctor
3   Manvi   20     Mumbai   89000        Eng.

### Removing a column

In [21]:
df.drop("Designation",axis = 1)

     Name  Age       City  Salary
0   Sneha   20  New delhi   65000
1   Aditi   21     Dinjan   78000
2  Shipra   19   Gurjarat   54000
3   Manvi   20     Mumbai   89000

In [23]:
df.drop("Designation",axis = 1,inplace = True)

In [24]:
df

     Name  Age       City  Salary
0   Sneha   20  New delhi   65000
1   Aditi   21     Dinjan   78000
2  Shipra   19   Gurjarat   54000
3   Manvi   20     Mumbai   89000

### Selection Rows

In [30]:
df.loc[[0,1]]

    Name  Age       City  Salary
0  Sneha   20  New delhi   65000
1  Aditi   21     Dinjan   78000

In [31]:
df.iloc[3] # work on integer or index

Name       Manvi
Age           20
City      Mumbai
Salary     89000
Name: 3, dtype: object

### Subsets of rows and column

In [32]:
df

     Name  Age       City  Salary
0   Sneha   20  New delhi   65000
1   Aditi   21     Dinjan   78000
2  Shipra   19   Gurjarat   54000
3   Manvi   20     Mumbai   89000

In [36]:
df.loc[[0,1]][['City','Salary']]

        City  Salary
0  New delhi   65000
1     Dinjan   78000

In [37]:
df.loc[[2,3]][['Name','Age']]

     Name  Age
2  Shipra   19
3   Manvi   20

### Conditional Selection

In [38]:
# select details of those who age is above 20
df[df["Age"] > 20]

    Name  Age    City  Salary
1  Aditi   21  Dinjan   78000

In [46]:
df[(df["Age"] > 20) & (df["City"] == "Dinjan")]

    Name  Age    City  Salary
1  Aditi   21  Dinjan   78000

### Finding Missing Data

In [14]:

data2 = {
    'A': [1,2,np.nan,4,5], 
    'B' : [1,2,3,4,5], 
    'C' : [1,2,3,np.nan,np.nan], 
    'D' : [1,np.nan,np.nan,np.nan,5]
}

df2 = pd.DataFrame(data2)

In [15]:
df2

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [16]:
print(df2.isna())

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [17]:
df2.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [18]:
df2.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

### Removing Missing Values

In [19]:
df2.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [20]:
df2

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [25]:
df2.dropna(thresh=3)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [27]:
df2.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [29]:
values = {'A':0,'B':100,'C':300,'D':400}
df2.fillna(value=values)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  400.0
2  0.0  3    3.0  400.0
3  4.0  4  300.0  400.0
4  5.0  5  300.0    5.0

In [32]:
df2.fillna(df2.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

### Merging 2 DataFrame

In [33]:
employees = pd.DataFrame(
    {
        'emp_id' : [1,2,3,4,5], 
        'name' : ['Sneha','Manvi','Shipra','Aditi','khushi'], 
        'department' : ['HR','IT','Finance','IT','HR'], 
    }
)

salaries = pd.DataFrame(
    {
        'emp_id' : [1,2,3,6,7], 
        'salary' : [600000,800000,650000,700000,900000], 
        'bonus' : [5000,10000,70000,80000,12000]
    }
)

In [34]:
employees

   emp_id    name department
0       1   Sneha         HR
1       2   Manvi         IT
2       3  Shipra    Finance
3       4   Aditi         IT
4       5  khushi         HR

In [35]:
salaries

   emp_id  salary  bonus
0       1  600000   5000
1       2  800000  10000
2       3  650000  70000
3       6  700000  80000
4       7  900000  12000

In [38]:
pd.merge(employees,salaries,on="emp_id",how = "inner")

   emp_id    name department  salary  bonus
0       1   Sneha         HR  600000   5000
1       2   Manvi         IT  800000  10000
2       3  Shipra    Finance  650000  70000

In [39]:
pd.merge(employees,salaries,on="emp_id",how = "outer")

   emp_id    name department    salary    bonus
0       1   Sneha         HR  600000.0   5000.0
1       2   Manvi         IT  800000.0  10000.0
2       3  Shipra    Finance  650000.0  70000.0
3       4   Aditi         IT       NaN      NaN
4       5  khushi         HR       NaN      NaN
5       6     NaN        NaN  700000.0  80000.0
6       7     NaN        NaN  900000.0  12000.0

In [40]:
pd.merge(employees,salaries,on="emp_id",how = "left")

   emp_id    name department    salary    bonus
0       1   Sneha         HR  600000.0   5000.0
1       2   Manvi         IT  800000.0  10000.0
2       3  Shipra    Finance  650000.0  70000.0
3       4   Aditi         IT       NaN      NaN
4       5  khushi         HR       NaN      NaN

In [41]:
pd.merge(employees,salaries,on="emp_id",how = "right")

   emp_id    name department  salary  bonus
0       1   Sneha         HR  600000   5000
1       2   Manvi         IT  800000  10000
2       3  Shipra    Finance  650000  70000
3       6     NaN        NaN  700000  80000
4       7     NaN        NaN  900000  12000

### Concatination of 2 DataFrame

In [2]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'], 
    'C':['C0','C1','C2']
})

df2 = pd.DataFrame(
    {
      'A':['A3','A4','A5'],
      'B':['B3','B4','B5'], 
      'C':['C3','C4','C5']  
    }
)

In [3]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [4]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [6]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [7]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

**Joining two DataFrames**

In [10]:
df1 = pd.DataFrame({ 
    'NAME': ['Sneha','Manvi','Riya']
    },index = [1,2,3])

df2 = pd.DataFrame({
    'Score' : [90,78,98]
},index = [2,3,4])

In [11]:
df2

   Score
2     90
3     78
4     98

In [13]:
df1.join(df2)

    NAME  Score
1  Sneha    NaN
2  Manvi   90.0
3   Riya   78.0

In [14]:
df2.join(df1)

   Score   NAME
2     90  Manvi
3     78   Riya
4     98    NaN

**GroupBY**

In [18]:
data = {
    'Category' : ['A','B','A','B','A','B','A','B'], 
    'Store' : ['S1','S1','S2','S2','S1','S2','S2','S1'], 
    'Sales' : [100,200,150,250,120,180,200,300], 
    'Quantity' : [10,15,12,18,8,20,15,25], 
    'Date' : pd.date_range('2023-01-01',periods=8)
} 

df = pd.DataFrame(data)

In [19]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [23]:
# group by category and calculate the sum of sales

cat = df.groupby('Category')
for i,v in cat:
    print(i) 
    print(v)

A
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
7        B    S1    300        25 2023-01-08

In [26]:
cat = df.groupby('Category')['Sales'].sum()
print(cat)

Category
A    570
B    930
Name: Sales, dtype: int64

In [28]:
store_sum = df.groupby('Store')['Sales'].sum()
print(store_sum)

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [30]:
# Group by multiple columns
cat = df.groupby(['Category','Store'])['Sales'].sum()
print(cat)

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

**Aggregation**

In [35]:
df['Sales'].mean()

np.float64(187.5)

In [36]:
df['Sales'].median()

190.0

In [37]:
df['Sales'].min()

100

In [38]:
df['Sales'].max()

300

In [39]:
df['Sales'].std()

66.06274074155351

In [40]:
df['Sales'].var()

4364.285714285715

In [41]:
df['Sales'].count()

np.int64(8)

In [45]:
df['Sales'].agg(['mean','min','max'])

mean    187.5
min     100.0
max     300.0
Name: Sales, dtype: float64

In [46]:
df['Sales'].mode()

0    200
Name: Sales, dtype: int64

**Pivot Tables**

In [63]:

data = {
    'Date' : pd.date_range('2023-01-01',periods=20), 
    'Product' : ['A','B','C','D','E']*4, 
    'Region' : ['East','West','North','South']*5,
    'Units' : np.random.randint(10,100,20), 
    'Sales' : np.random.randint(100,1000,20), 
    'Rep' : ['Sneha','Manvi','Riya','Shipra']*5
} 
df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [64]:
df

         Date Product Region  Units  Sales     Rep    Month Quarter
0  2023-01-01       A   East     58    352   Sneha  January      Q1
1  2023-01-02       B   West     89    466   Manvi  January      Q1
2  2023-01-03       C  North     58    712    Riya  January      Q1
3  2023-01-04       D  South     21    535  Shipra  January      Q1
4  2023-01-05       E   East     49    686   Sneha  January      Q1
5  2023-01-06       A   West     58    359   Manvi  January      Q1
6  2023-01-07       B  North     22    259    Riya  January      Q1
7  2023-01-08       C  South     46    945  Shipra  January      Q1
8  2023-01-09       D   East     58    955   Sneha  January      Q1
9  2023-01-10       E   West     37    268   Manvi  January      Q1
10 2023-01-11       A  North     94    178    Riya  January      Q1
11 2023-01-12       B  South     76    498  Shipra  January      Q1
12 2023-01-13       C   East     75    254   Sneha  January      Q1
13 2023-01-14       D   West     24    208   Manvi  January      Q1
14 2023-01-15       E  North     39    877    Riya  January      Q1
15 2023-01-16       A  South     11    756  Shipra  January      Q1
16 2023-01-17       B   East     22    564   Sneha  January      Q1
17 2023-01-18       C   West     71    831   Manvi  January      Q1
18 2023-01-19       D  North     43    562    Riya  January      Q1
19 2023-01-20       E  South     97    438  Shipra  January      Q1

In [69]:
pd.pivot_table(df,values = 'Sales',index = 'Region',columns='Product',aggfunc='median')

Product      A      B      C      D      E
Region
East     352.0  564.0  254.0  955.0  686.0
North    178.0  259.0  712.0  562.0  877.0
South    756.0  498.0  945.0  535.0  438.0
West     359.0  466.0  831.0  208.0  268.0

In [70]:
pd.pivot_table(df,values = ['Sales','Units'],index = 'Region',columns='Product',aggfunc='median')

         Sales                             Units
Product      A      B      C      D      E     A     B     C     D     E
Region
East     352.0  564.0  254.0  955.0  686.0  58.0  22.0  75.0  58.0  49.0
North    178.0  259.0  712.0  562.0  877.0  94.0  22.0  58.0  43.0  39.0
South    756.0  498.0  945.0  535.0  438.0  11.0  76.0  46.0  21.0  97.0
West     359.0  466.0  831.0  208.0  268.0  58.0  89.0  71.0  24.0  37.0

**Cross Tabs**

In [71]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D  E
Region
East     1  1  1  1  1
North    1  1  1  1  1
South    1  1  1  1  1
West     1  1  1  1  1

### Operations

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'A' : [1,2,3,4,5], 
    'B' : [10,20,30,40,50], 
    'C' : [100,200,300,400,500]
})

In [4]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [5]:
df1.shape

(5, 3)

In [6]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [10]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [11]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

**DataFrames Applying Functions**

In [12]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [13]:
def square(x):
    return x**2

In [17]:
df1['A'] = df1['A'].apply(square)

In [18]:
df1

    A   B    C
0   1  10  100
1   4  20  200
2   9  30  300
3  16  40  400
4  25  50  500

In [19]:
df1['D'] = df1['A'].apply(square)

In [20]:
df1

    A   B    C    D
0   1  10  100    1
1   4  20  200   16
2   9  30  300   81
3  16  40  400  256
4  25  50  500  625

In [ ]:
# feature extraction next ---